RT-Thread/rt-thread/bsp/mm32l07x/Libraries/MM32L0xx/Include/MM32L0xx.h
/** @addtogroup Exported_types
* @{
*/

/*!< MM32L0xx Standard Peripheral Library old types (maintained for legacy prupose) */

typedef int32_t  s32;
typedef int16_t s16;
typedef int8_t  s8;

typedef const int32_t sc32;  /*!< Read Only */
typedef const int16_t sc16;  /*!< Read Only */
typedef const int8_t sc8;   /*!< Read Only */

typedef __IO int32_t  vs32;
typedef __IO int16_t  vs16;
typedef __IO int8_t   vs8;

typedef __I int32_t vsc32;  /*!< Read Only */
typedef __I int16_t vsc16;  /*!< Read Only */
typedef __I int8_t vsc8;   /*!< Read Only */

typedef uint32_t  u32;
typedef uint16_t u16;
typedef uint8_t  u8;

typedef const uint32_t uc32;  /*!< Read Only */
typedef const uint16_t uc16;  /*!< Read Only */
typedef const uint8_t uc8;   /*!< Read Only */

typedef __IO uint32_t  vu32;
typedef __IO uint16_t vu16;
typedef __IO uint8_t  vu8;

typedef __I uint32_t vuc32;  /*!< Read Only */
typedef __I uint16_t vuc16;  /*!< Read Only */
typedef __I uint8_t vuc8;   /*!< Read Only */

typedef enum {FALSE = 0, TRUE = !FALSE} bool;

typedef enum {RESET = 0, SET = !RESET} FlagStatus, ITStatus;

typedef enum {DISABLE = 0, ENABLE = !DISABLE} FunctionalState;
#define IS_FUNCTIONAL_STATE(STATE) (((STATE) == DISABLE) || ((STATE) == ENABLE))

typedef enum {ERROR = 0, SUCCESS = !ERROR} ErrorStatus;



/**
* @}
*/

/** @addtogroup Peripheral_registers_structures
* @{
*/

/**
* @brief Analog to Digital Converter
*/

typedef struct
{
  __IO uint32_t ADDATA;
  __IO uint32_t ADCFG;
  __IO uint32_t ADCR;
  __IO uint32_t ADCHS;
  __IO uint32_t ADCMPR;
  __IO uint32_t ADSTA;
  __IO uint32_t ADDR0;
  __IO uint32_t ADDR1;
  __IO uint32_t ADDR2;
  __IO uint32_t ADDR3;
  __IO uint32_t ADDR4;
  __IO uint32_t ADDR5;
  __IO uint32_t ADDR6;
  __IO uint32_t ADDR7;
  __IO uint32_t ADDR8;
  __IO uint32_t ADDR9;
  __IO uint32_t ADDR10;
  __IO uint32_t ADDR11;
} ADC_TypeDef;
/**
* @brief Backup Registers
*/

typedef struct
{
  uint32_t  RESERVED0;//0x00
  __IO uint16_t DR1_RESERVED;//0x04
  uint16_t  RESERVED1;
  __IO uint16_t DR2_RESERVED;
  uint16_t  RESERVED2;
  __IO uint16_t DR3_RESERVED;
  uint16_t  RESERVED3;
  __IO uint16_t DR4_RESERVED;//0x10
  uint16_t  RESERVED4;
  __IO uint16_t DR5_RESERVED;
  uint16_t  RESERVED5;
  __IO uint16_t DR6_RESERVED;
  uint16_t  RESERVED6;
  __IO uint16_t DR7_RESERVED;
  uint16_t  RESERVED7;
  __IO uint16_t DR8_RESERVED;//0x20
  uint16_t  RESERVED8;
  __IO uint16_t DR9_RESERVED;
  uint16_t  RESERVED9;
  __IO uint16_t DR10_RESERVED;
  uint16_t  RESERVED10;
  __IO uint16_t RTCCR;//0x2C
  uint16_t  RESERVED11;
  __IO uint16_t CR_RESERVED;//0x30
  uint16_t  RESERVED12;
  __IO uint16_t CSR_RESERVED;//0x34
  uint16_t  RESERVED13;

  uint32_t  RESERVED14;//0x38
  uint32_t  RESERVED15;//0x3C
  uint32_t  RESERVED16;//0x40
  uint32_t  RESERVED17;//0x44
  uint32_t  RESERVED18;//0x48
  uint32_t  RESERVED19;//0x4C

  __IO uint16_t DR1;//0x50
  uint16_t  RESERVED20;
  __IO uint16_t DR2;//0x54
  uint16_t  RESERVED22;
  __IO uint16_t DR3;//0x58
  uint16_t  RESERVED23;
  __IO uint16_t DR4;//0x5C
  uint16_t  RESERVED24;
  __IO uint16_t DR5;//0x60
  uint16_t  RESERVED25;
  __IO uint16_t DR6;//0x64
  uint16_t  RESERVED26;
  __IO uint16_t DR7;//0x68
  uint16_t  RESERVED27;
  __IO uint16_t DR8;//0x6C
  uint16_t  RESERVED28;
  __IO uint16_t DR9;//0x70
  uint16_t  RESERVED29;
  __IO uint16_t DR10;//0x74
  uint16_t  RESERVED30;

} BKP_TypeDef;
/**
* @brief CAN basic
*/
typedef struct
{
  __IO uint32_t CR;         //0x00
  __IO uint32_t CMR;        //0x04
  __IO uint32_t SR;         //0x08
  __IO uint32_t IR;         //0x0c
  __IO uint32_t ACR;        //0x10
  __IO uint32_t AMR;        //0x14
  __IO uint32_t BTR0;       //0x18
  __IO uint32_t BTR1;       //0x1C
  __IO uint32_t  RESERVED0; //0x20
  uint32_t RESERVED1;       //0x24
  __IO uint32_t TXID0;      //0x28
  __IO uint32_t TXID1;      //0x2c
  __IO uint32_t TXDR0;      //0x30
  __IO uint32_t TXDR1;      //0x34
  __IO uint32_t TXDR2;      //0x38
  __IO uint32_t TXDR3;      //0x3c
  __IO uint32_t TXDR4;      //0x40
  __IO uint32_t TXDR5;      //0x44
  __IO uint32_t TXDR6;      //0x48
  __IO uint32_t TXDR7;      //0x4c
  __IO uint32_t RXID0;      //0x50
  __IO uint32_t RXID1;      //0x54
  __IO uint32_t RXDR0;      //0x58
  __IO uint32_t RXDR1;      //0x5C
  __IO uint32_t RXDR2;      //0x60
  __IO uint32_t RXDR3;
  __IO uint32_t RXDR4;
  __IO uint32_t RXDR5;      //0x6c
  __IO uint32_t RXDR6;      //0x70
  __IO uint32_t RXDR7;      //0x74
  uint32_t RESERVED2;
  __IO uint32_t CDR;        //0x7c
}CAN_TypeDef;

/**
* @brief CAN Peli
*/
typedef struct
{
  __IO uint32_t MOD;
  __IO uint32_t CMR;
  __IO uint32_t SR;
  __IO uint32_t IR;
  __IO uint32_t IER;    //0x10h
  uint32_t RESERVED0;
  __IO uint32_t BTR0;
  __IO uint32_t BTR1;
  uint32_t RESERVED1;   //0x20h
  uint32_t RESERVED2;
  uint32_t RESERVED3;
  __IO uint32_t ALC;
  __IO uint32_t ECC;    //0x30h
  __IO uint32_t EWLR;
  __IO uint32_t RXERR;
  __IO uint32_t TXERR;
  __IO uint32_t FF;     //0x40
  __IO uint32_t ID0;
  __IO uint32_t ID1;
  __IO uint32_t DATA0;
  __IO uint32_t DATA1;  //0x50
  __IO uint32_t DATA2;
  __IO uint32_t DATA3;
  __IO uint32_t DATA4;
  __IO uint32_t DATA5;  //0x60
  __IO uint32_t DATA6;
  __IO uint32_t DATA7;
  __IO uint32_t DATA8;
  __IO uint32_t DATA9;  //0x70
  __IO uint32_t RMC;
  __IO uint32_t RBSA;
  __IO uint32_t CDR;
}CAN_Peli_TypeDef;




/**
* @brief Debug MCU
*/

typedef struct
{
  __IO uint32_t IDCODE;
  __IO uint32_t CR;
}DBGMCU_TypeDef;

/**
* @brief DMA Controller
*/

typedef struct
{
  __IO uint32_t CCR;
  __IO uint32_t CNDTR;
  __IO uint32_t CPAR;
  __IO uint32_t CMAR;
} DMA_Channel_TypeDef;

typedef struct
{
  __IO uint32_t ISR;
  __IO uint32_t IFCR;
} DMA_TypeDef;

/**
* @brief External Interrupt/Event Controller
*/

typedef struct
{
  __IO uint32_t IMR;
  __IO uint32_t EMR;
  __IO uint32_t RTSR;
  __IO uint32_t FTSR;
  __IO uint32_t SWIER;
  __IO uint32_t PR;
} EXTI_TypeDef;

/**
* @brief FLASH Registers
*/

typedef struct
{
  __IO uint32_t ACR;
  __IO uint32_t KEYR;
  __IO uint32_t OPTKEYR;
  __IO uint32_t SR;
  __IO uint32_t CR;
  __IO uint32_t AR;
  __IO uint32_t RESERVED;
  __IO uint32_t OBR;
  __IO uint32_t WRPR;
} FLASH_TypeDef;

/**
* @brief Option Bytes Registers
*/

typedef struct
{
  __IO uint16_t RDP;
  __IO uint16_t USER;
  __IO uint16_t Data0;
  __IO uint16_t Data1;
  __IO uint16_t WRP0;
  __IO uint16_t WRP1;
  __IO uint16_t WRP2;
  __IO uint16_t WRP3;
} OB_TypeDef;


/**
* @brief General Purpose IO
*/

typedef struct
{
  __IO uint32_t CRL;
  __IO uint32_t CRH;
  __IO uint32_t IDR;
  __IO uint32_t ODR;
  __IO uint32_t BSRR;
  __IO uint32_t BRR;
  __IO uint32_t LCKR;
  __IO uint32_t RESERVED0;
  __IO uint32_t AFRL;
  __IO uint32_t AFRH;
} GPIO_TypeDef;

/**
* @brief SysTem Configuration
*/

typedef struct
{
  __IO uint32_t CFGR;       /*!< SYSCFG configuration register ,                           Address offset: 0x00 */
  __IO uint32_t RESERVED0;
  __IO uint32_t EXTICR[4];

} SYSCFG_TypeDef;

/**
* @brief Alternate Function IO
*/

typedef struct
{
  __IO uint32_t EVCR;
  __IO uint32_t MAPR;
  __IO uint32_t EXTICR[4];
} AFIO_TypeDef;
/**
* @brief Inter-integrated Circuit Interface
*/

typedef struct
{
  __IO uint16_t IC_CON;
  uint16_t  RESERVED0;
  __IO uint16_t IC_TAR;
  uint16_t  RESERVED1;
  __IO uint16_t IC_SAR;
  uint16_t  RESERVED2;
  __IO uint16_t IC_HS_MADDR_RESERVED;
  uint16_t  RESERVED3;
  __IO uint16_t IC_DATA_CMD;
  uint16_t  RESERVED4;
  __IO uint16_t IC_SS_SCL_HCNT;
  uint16_t  RESERVED5;
  __IO uint16_t IC_SS_SCL_LCNT;
  uint16_t  RESERVED6;
  __IO uint16_t IC_FS_SCL_HCNT;
  uint16_t  RESERVED7;
  __IO uint16_t IC_FS_SCL_LCNT;
  uint16_t  RESERVED8;
  __IO uint16_t IC_HS_SCL_HCNT_RESERVED;
  uint16_t  RESERVED9;
  __IO uint16_t IC_HS_SCL_LCNT_RESERVED;
  uint16_t  RESERVED10;
  __IO uint16_t IC_INTR_STAT;
  uint16_t  RESERVED11;
  __IO uint16_t IC_INTR_MASK;
  uint16_t  RESERVED12;
  __IO uint16_t IC_RAW_INTR_STAT;
  uint16_t  RESERVED13;
  __IO uint16_t IC_RX_TL;
  uint16_t  RESERVED14;
  __IO uint16_t IC_TX_TL;
  uint16_t  RESERVED15;
  __IO uint16_t IC_CLR_INTR;
  uint16_t  RESERVED16;
  __IO uint16_t IC_CLR_RX_UNDER;
  uint16_t  RESERVED17;
  __IO uint16_t IC_CLR_RX_OVER;
  uint16_t  RESERVED18;
  __IO uint16_t IC_CLR_TX_OVER;
  uint16_t  RESERVED19;
  __IO uint16_t IC_CLR_RD_REQ;
  uint16_t  RESERVED20;
  __IO uint16_t IC_CLR_TX_ABRT;
  uint16_t  RESERVED21;
  __IO uint16_t IC_CLR_RX_DONE;
  uint16_t  RESERVED22;
  __IO uint16_t IC_CLR_ACTIVITY;
  uint16_t  RESERVED23;
  __IO uint16_t IC_CLR_STOP_DET;
  uint16_t  RESERVED24;
  __IO uint16_t IC_CLR_START_DET;
  uint16_t  RESERVED25;
  __IO uint16_t IC_CLR_GEN_CALL;
  uint16_t  RESERVED26;
  __IO uint16_t IC_ENABLE;
  uint16_t  RESERVED27;

  __IO uint32_t IC_STATUS;
  __IO uint32_t IC_TXFLR;
  __IO uint32_t IC_RXFLR;
  __IO uint32_t IC_SDA_HOLD;
  __IO uint32_t IC_TX_ABRT_SOURCE_RESERVED;
  __IO uint32_t IC_SLV_DATA_NACK_ONLY_RESERVED;
  __IO uint32_t IC_DMA_CR;
  __IO uint32_t IC_DMA_TDLR_RESERVED;
  __IO uint32_t IC_DMA_RDLR_RESERVED;
  __IO uint32_t IC_SDA_SETUP;
  __IO uint32_t IC_ACK_GENERAL_CALL;
} I2C_TypeDef;

/**
* @brief Independent WATCHDOG
*/

typedef struct
{
  __IO uint32_t KR;
  __IO uint32_t PR;
  __IO uint32_t RLR;
  __IO uint32_t SR;
} IWDG_TypeDef;

/**
* @brief Power Control
*/

typedef struct
{
  __IO uint32_t CR;
  __IO uint32_t CSR;
} PWR_TypeDef;

/**
* @brief Reset and Clock Control
*/

typedef struct
{
  __IO uint32_t CR;
  __IO uint32_t CFGR;
  __IO uint32_t CIR;
  __IO uint32_t APB2RSTR;
  __IO uint32_t APB1RSTR;
  __IO uint32_t AHBENR;
  __IO uint32_t APB2ENR;
  __IO uint32_t APB1ENR;
  __IO uint32_t BDCR;
  __IO uint32_t CSR;
} RCC_TypeDef;



/**
* @brief Serial Peripheral Interface
*/


typedef struct
{
  __IO uint32_t TXREG;
  __IO uint32_t RXREG;
  __IO uint16_t CSTAT;
  uint16_t  RESERVED0;
  __IO uint16_t INTSTAT;
  uint16_t  RESERVED1;
  __IO uint16_t INTEN;
  uint16_t  RESERVED2;
  __IO uint16_t INTCLR;
  uint16_t  RESERVED3;
  __IO uint16_t GCTL;
  uint16_t  RESERVED4;
  __IO uint16_t CCTL;
  uint16_t  RESERVED5;
  __IO uint16_t SPBRG;
  uint16_t  RESERVED6;
  __IO uint16_t RXDNR;
  uint16_t  RESERVED7;
  __IO uint16_t NSSR;
  uint16_t  RESERVED8;
  __IO uint16_t EXTCTL;
  uint16_t  RESERVED9;
} SPI_TypeDef;


/**
* @brief TIM
*/

typedef struct
{
  __IO uint32_t CR1;
  __IO uint32_t CR2;
  __IO uint32_t SMCR;
  __IO uint32_t DIER;
  __IO uint32_t SR;
  __IO uint32_t EGR;
  __IO uint32_t CCMR1;
  __IO uint32_t CCMR2;
  __IO uint32_t CCER;
  __IO uint32_t CNT;
  __IO uint32_t PSC;
  __IO uint32_t ARR;
  __IO uint32_t RCR;
  __IO uint32_t CCR1;
  __IO uint32_t CCR2;
  __IO uint32_t CCR3;
  __IO uint32_t CCR4;
  __IO uint32_t BDTR;
  __IO uint32_t DCR;
  __IO uint32_t DMAR;
} TIM_TypeDef;

/**
* @brief Universal Synchronous Asynchronous Receiver Transmitter
*/

typedef struct
{
  __IO uint32_t TDR;
  __IO uint32_t RDR;
  __IO uint32_t CSR;
  __IO uint32_t ISR;
  __IO uint32_t IER;
  __IO uint32_t ICR;
  __IO uint32_t GCR;
  __IO uint32_t CCR;
  __IO uint32_t BRR;
  __IO uint32_t FRA;
} UART_TypeDef;

/**
* @brief Window WATCHDOG
*/

typedef struct
{
  __IO uint32_t CR;
  __IO uint32_t CFR;
  __IO uint32_t SR;
} WWDG_TypeDef;


typedef struct
{
  __IO uint32_t CR;
  __IO uint32_t SR;
  __IO uint32_t DINR;
  __IO uint32_t DOUTR;
  __IO uint32_t KEYR0;
  __IO uint32_t KEYR1;
  __IO uint32_t KEYR2;
  __IO uint32_t KEYR3;
  __IO uint32_t IVR0;
  __IO uint32_t IVR1;
  __IO uint32_t IVR2;
  __IO uint32_t IVR3;
  __IO uint32_t KEYR4;
  __IO uint32_t KEYR5;
  __IO uint32_t KEYR6;
  __IO uint32_t KEYR7;

} AES_TypeDef;
/**
* @brief CRS
*/
typedef struct
{
  __IO uint32_t CR;
  __IO uint32_t CFGR;
  __IO uint32_t ISR;
  __IO uint32_t ICR;

} CRS_TypeDef;

/**
* @brief Analog Comparators
*/

typedef struct
{
  __IO uint32_t CSR;    /*!< Comparator control Status register, Address offset: 0x00 */
} COMP_TypeDef;

/**
* @brief USB
*/
typedef struct
{
  __IO uint32_t  TOP;                   /*!           Address offset: 0x00 */
  __IO uint32_t  INT_STATE;             /*!           Address offset: 0x04 */
  __IO uint32_t  EP_INT_STATE;          /*!           Address offset: 0x08 */
  __IO uint32_t  EP0_INT_STATE;         /*!           Address offset: 0x0C */
  __IO uint32_t  INT_EN;                /*!           Address offset: 0x10 */
  __IO uint32_t  EP_INT_EN;             /*!           Address offset: 0x14 */
  __IO uint32_t  EP0_INT_EN;            /*!           Address offset: 0x18 */
  __IO uint32_t  RESERVED0;
  __IO uint32_t  EP1_INT_STATE;         /*!           Address offset: 0x20 */
  __IO uint32_t  EP2_INT_STATE;         /*!           Address offset: 0x24 */
  __IO uint32_t  EP3_INT_STATE;         /*!           Address offset: 0x28 */
  __IO uint32_t  EP4_INT_STATE;         /*!           Address offset: 0x2C */

