RT-Thread/rt-thread/bsp/mm32l07x/Libraries/MM32L0xx/Include/MM32L0xx.h
  __IO uint32_t  RESERVED1;             /*!           Address offset: 0x30 */
  __IO uint32_t  RESERVED2;             /*!           Address offset: 0x34 */
  __IO uint32_t  RESERVED3;             /*!           Address offset: 0x38 */
  __IO uint32_t  RESERVED4;             /*!           Address offset: 0x3C */

  __IO uint32_t  EP1_INT_EN;            /*!           Address offset: 0x40 */
  __IO uint32_t  EP2_INT_EN;            /*!           Address offset: 0x44 */
  __IO uint32_t  EP3_INT_EN;            /*!           Address offset: 0x48 */
  __IO uint32_t  EP4_INT_EN;            /*!           Address offset: 0x4C */

  __IO uint32_t  RESERVED5;             /*!           Address offset: 0x50 */
  __IO uint32_t  RESERVED6;             /*!           Address offset: 0x54 */
  __IO uint32_t  RESERVED7;             /*!           Address offset: 0x58 */
  __IO uint32_t  RESERVED8;             /*!           Address offset: 0x5C */

  __IO uint32_t  ADDR;                  /*!           Address offset: 0x60 */
  __IO uint32_t  EP_EN;                 /*!           Address offset: 0x64 */

  __IO uint32_t  RESERVED9;             /*!           Address offset: 0x68 */
  __IO uint32_t  RESERVED10;            /*!           Address offset: 0x6C */
  __IO uint32_t  RESERVED11;            /*!           Address offset: 0x70 */
  __IO uint32_t  RESERVED12;            /*!           Address offset: 0x74 */

  __IO uint32_t  TOG_CTRL1_4;           /*!           Address offset: 0x78 */

  __IO uint32_t  RESERVED13;            /*!           Address offset: 0x7C */

  __IO uint32_t  SETUP[8];              /*!           Address offset: 0x80 */
  __IO uint32_t  PAKET_SIZE0;           /*!           Address offset: 0xA0 */
  __IO uint32_t  PAKET_SIZE1;           /*!           Address offset: 0xA4 */

  __IO uint32_t  RESERVED14;            /*!           Address offset: 0xA8 */
  __IO uint32_t  RESERVED15;            /*!           Address offset: 0xAC */

  __IO uint32_t  RESERVED16;            /*!           Address offset: 0xB0 */
  __IO uint32_t  RESERVED17;            /*!           Address offset: 0xB4 */
  __IO uint32_t  RESERVED18;            /*!           Address offset: 0xB8 */
  __IO uint32_t  RESERVED19;            /*!           Address offset: 0xBC */

  __IO uint32_t  RESERVED20;            /*!           Address offset: 0xC0 */
  __IO uint32_t  RESERVED21;            /*!           Address offset: 0xC4 */
  __IO uint32_t  RESERVED22;            /*!           Address offset: 0xC8 */
  __IO uint32_t  RESERVED23;            /*!           Address offset: 0xCC */

  __IO uint32_t  RESERVED24;            /*!           Address offset: 0xD0 */
  __IO uint32_t  RESERVED25;            /*!           Address offset: 0xD4 */
  __IO uint32_t  RESERVED26;            /*!           Address offset: 0xD8 */
  __IO uint32_t  RESERVED27;            /*!           Address offset: 0xDC */

  __IO uint32_t  RESERVED28;            /*!           Address offset: 0xE0 */
  __IO uint32_t  RESERVED29;            /*!           Address offset: 0xE4 */
  __IO uint32_t  RESERVED30;            /*!           Address offset: 0xE8 */
  __IO uint32_t  RESERVED31;            /*!           Address offset: 0xEC */

  __IO uint32_t  RESERVED32;            /*!           Address offset: 0xF0 */
  __IO uint32_t  RESERVED33;            /*!           Address offset: 0xF4 */
  __IO uint32_t  RESERVED34;            /*!           Address offset: 0xF8 */
  __IO uint32_t  RESERVED35;            /*!           Address offset: 0xFC */

  __IO uint32_t  EP0_AVIL;              /*!           Address offset: 0x100 */
  __IO uint32_t  EP1_AVIL;              /*!           Address offset: 0x104 */
  __IO uint32_t  EP2_AVIL;              /*!           Address offset: 0x108 */
  __IO uint32_t  EP3_AVIL;              /*!           Address offset: 0x10C */
  __IO uint32_t  EP4_AVIL;              /*!           Address offset: 0x110 */

  __IO uint32_t  RESERVED36;            /*!           Address offset: 0x114 */
  __IO uint32_t  RESERVED37;            /*!           Address offset: 0x118 */
  __IO uint32_t  RESERVED38;            /*!           Address offset: 0x11C */
  __IO uint32_t  RESERVED39;            /*!           Address offset: 0x120 */

  __IO uint32_t  RESERVED40;            /*!           Address offset: 0x124 */
  __IO uint32_t  RESERVED41;            /*!           Address offset: 0x128 */
  __IO uint32_t  RESERVED42;            /*!           Address offset: 0x12C */
  __IO uint32_t  RESERVED43;            /*!           Address offset: 0x130 */

  __IO uint32_t  RESERVED44;            /*!           Address offset: 0x134 */
  __IO uint32_t  RESERVED45;            /*!           Address offset: 0x138 */
  __IO uint32_t  RESERVED46;            /*!           Address offset: 0x13C */

  __IO uint32_t  EP0_CTRL;              /*!           Address offset: 0x140 */
  __IO uint32_t  EP1_CTRL;              /*!           Address offset: 0x144 */
  __IO uint32_t  EP2_CTRL;              /*!           Address offset: 0x148 */
  __IO uint32_t  EP3_CTRL;              /*!           Address offset: 0x14C */
  __IO uint32_t  EP4_CTRL;              /*!           Address offset: 0x150 */

  __IO uint32_t  RESERVED47;            /*!           Address offset: 0x154 */
  __IO uint32_t  RESERVED48;            /*!           Address offset: 0x158 */
  __IO uint32_t  RESERVED49;            /*!           Address offset: 0x15C */
  __IO uint32_t  EP0_FIFO;              /*!           Address offset: 0x160 */
  __IO uint32_t  EP1_FIFO;              /*!           Address offset: 0x164 */
  __IO uint32_t  EP2_FIFO;              /*!           Address offset: 0x168 */
  __IO uint32_t  EP3_FIFO;              /*!           Address offset: 0x16C */
  __IO uint32_t  EP4_FIFO;              /*!           Address offset: 0x170 */
  __IO uint32_t  RESERVED51;            /*!           Address offset: 0x174 */
  __IO uint32_t  RESERVED52;            /*!           Address offset: 0x178 */
  __IO uint32_t  RESERVED53;            /*!           Address offset: 0x17C */
  __IO uint32_t  RESERVED54;            /*!           Address offset: 0x180 */
  __IO uint32_t  EP_DMA;                /*!           Address offset: 0x184 */
  __IO uint32_t  EP_HALT;               /*!           Address offset: 0x188 */
  __IO uint32_t  RESERVED55;            /*!           Address offset: 0x18C */
  __IO uint32_t  RESERVED56;            /*!           Address offset: 0x190 */
  __IO uint32_t  RESERVED57;            /*!           Address offset: 0x194 */
  __IO uint32_t  RESERVED58;            /*!           Address offset: 0x198 */
  __IO uint32_t  RESERVED59;            /*!           Address offset: 0x19C */
  __IO uint32_t  RESERVED60;            /*!           Address offset: 0x1A0 */
  __IO uint32_t  RESERVED61;            /*!           Address offset: 0x1A4 */
  __IO uint32_t  RESERVED62;            /*!           Address offset: 0x1A8 */
  __IO uint32_t  RESERVED63;            /*!           Address offset: 0x1AC */
  __IO uint32_t  RESERVED64;            /*!           Address offset: 0x1B0 */
  __IO uint32_t  RESERVED65;            /*!           Address offset: 0x1B4 */
  __IO uint32_t  RESERVED66;            /*!           Address offset: 0x1B8 */
  __IO uint32_t  RESERVED67;            /*!           Address offset: 0x1BC */
  __IO uint32_t  POWER;                 /*!           Address offset: 0x1C0 */
} USB_TypeDef;



/**
* @}
*/

/** @addtogroup Peripheral_memory_map
* @{
*/

