RT-Thread/rt-thread/bsp/mm32l07x/Libraries/MM32L0xx/Include/MM32L0xx.h
#define  EP4_CTRL_TRANCOUNT                 ((uint16_t)0x007F)
#define  EP4_CTRL_TRANCOUNT_0               ((uint16_t)0x0001)
#define  EP4_CTRL_TRANCOUNT_1               ((uint16_t)0x0002)
#define  EP4_CTRL_TRANCOUNT_2               ((uint16_t)0x0004)
#define  EP4_CTRL_TRANCOUNT_3               ((uint16_t)0x0008)
#define  EP4_CTRL_TRANCOUNT_4               ((uint16_t)0x0010)
#define  EP4_CTRL_TRANCOUNT_5               ((uint16_t)0x0020)
#define  EP4_CTRL_TRANCOUNT_6               ((uint16_t)0x0040)

/*******************  Bit definition for EP_DMA register  *******************/
#define  EP_DMA_DMA1EN                      ((uint16_t)0x0001)
#define  EP_DMA_DMA2EN                      ((uint16_t)0x0002)

/*******************  Bit definition for EP_HALT register  *******************/
#define  EP_HALT_HALT0                      ((uint16_t)0x0001)
#define  EP_HALT_HALT1                      ((uint16_t)0x0002)
#define  EP_HALT_HALT2                      ((uint16_t)0x0004)
#define  EP_HALT_HALT3                      ((uint16_t)0x0008)
#define  EP_HALT_HALT4                      ((uint16_t)0x0010)

/*******************  Bit definition for USB_POWER register  *******************/
#define  USB_POWER_SUSPEN                   ((uint16_t)0x0001)
#define  USB_POWER_SUSP                     ((uint16_t)0x0002)
#define  USB_POWER_WKUP                     ((uint16_t)0x0008)

/******************************************************************************/
/*                                                                            */
/*                                   CAN Registers and bits                   */
/*                                                                            */
/******************************************************************************/

/*!<BasicCAN registers */

/*******************  Bit definition for CAN_BASIC_CR register  *******************/
#define  CAN_BASIC_CR_RR                           ((uint16_t)0x0001)
#define  CAN_BASIC_CR_RIE                          ((uint16_t)0x0002)
#define  CAN_BASIC_CR_TIE                          ((uint16_t)0x0004)
#define  CAN_BASIC_CR_EIE                          ((uint16_t)0x0008)
#define  CAN_BASIC_CR_OIE                          ((uint16_t)0x0010)

/*******************  Bit definition for CAN_BASIC_CMR register  *******************/
#define  CAN_BASIC_CMR_TR                          ((uint16_t)0x0001)
#define  CAN_BASIC_CMR_AT                          ((uint16_t)0x0002)
#define  CAN_BASIC_CMR_RRB                         ((uint16_t)0x0004)
#define  CAN_BASIC_CMR_CDO                         ((uint16_t)0x0008)
#define  CAN_BASIC_CMR_GTS                         ((uint16_t)0x0010)

/*******************  Bit definition for CAN_BASIC_SR register  *******************/
#define  CAN_BASIC_SR_RBS                          ((uint16_t)0x0001)
#define  CAN_BASIC_SR_DOS                          ((uint16_t)0x0002)
#define  CAN_BASIC_SR_TBS                          ((uint16_t)0x0004)
#define  CAN_BASIC_SR_TCS                          ((uint16_t)0x0008)
#define  CAN_BASIC_SR_RS                           ((uint16_t)0x0010)
#define  CAN_BASIC_SR_TS                           ((uint16_t)0x0020)
#define  CAN_BASIC_SR_ES                           ((uint16_t)0x0040)
#define  CAN_BASIC_SR_BS                           ((uint16_t)0x0080)

/*******************  Bit definition for CAN_BASIC_IR register  *******************/
#define  CAN_BASIC_IR_RI                           ((uint16_t)0x0001)
#define  CAN_BASIC_IR_TI                           ((uint16_t)0x0002)
#define  CAN_BASIC_IR_EI                           ((uint16_t)0x0004)
#define  CAN_BASIC_IR_DOI                          ((uint16_t)0x0008)
#define  CAN_BASIC_IR_WUI                          ((uint16_t)0x0010)

/*******************  Bit definition for CAN_BASIC_ACR register  *******************/
#define  CAN_BASIC_ACR_AC                          ((uint16_t)0x00FF)
#define  CAN_BASIC_ACR_AC_0                        ((uint16_t)0x0001)
#define  CAN_BASIC_ACR_AC_1                        ((uint16_t)0x0002)
#define  CAN_BASIC_ACR_AC_2                        ((uint16_t)0x0004)
#define  CAN_BASIC_ACR_AC_3                        ((uint16_t)0x0008)
#define  CAN_BASIC_ACR_AC_4                        ((uint16_t)0x0010)
#define  CAN_BASIC_ACR_AC_5                        ((uint16_t)0x0020)
#define  CAN_BASIC_ACR_AC_6                        ((uint16_t)0x0040)
#define  CAN_BASIC_ACR_AC_7                        ((uint16_t)0x0080)

/*******************  Bit definition for CAN_BASIC_AMR register  *******************/
#define  CAN_BASIC_AMR_AM                          ((uint16_t)0x00FF)
#define  CAN_BASIC_AMR_AM_0                        ((uint16_t)0x0001)
#define  CAN_BASIC_AMR_AM_1                        ((uint16_t)0x0002)
#define  CAN_BASIC_AMR_AM_2                        ((uint16_t)0x0004)
#define  CAN_BASIC_AMR_AM_3                        ((uint16_t)0x0008)
#define  CAN_BASIC_AMR_AM_4                        ((uint16_t)0x0010)
#define  CAN_BASIC_AMR_AM_5                        ((uint16_t)0x0020)
#define  CAN_BASIC_AMR_AM_6                        ((uint16_t)0x0040)
#define  CAN_BASIC_AMR_AM_7                        ((uint16_t)0x0080)

/*******************  Bit definition for CAN_BASIC_BTR0 register  *******************/
#define  CAN_BASIC_BTR0_BRP                        ((uint16_t)0x003F)
#define  CAN_BASIC_BTR0_BRP_0                      ((uint16_t)0x0001)
#define  CAN_BASIC_BTR0_BRP_1                      ((uint16_t)0x0002)
#define  CAN_BASIC_BTR0_BRP_2                      ((uint16_t)0x0004)
#define  CAN_BASIC_BTR0_BRP_3                      ((uint16_t)0x0008)
#define  CAN_BASIC_BTR0_BRP_4                      ((uint16_t)0x0010)
#define  CAN_BASIC_BTR0_BRP_5                      ((uint16_t)0x0020)

#define  CAN_BASIC_BTR0_SJW                        ((uint16_t)0x00C0)
#define  CAN_BASIC_BTR0_SJW_0                      ((uint16_t)0x0040)
#define  CAN_BASIC_BTR0_SJW_1                      ((uint16_t)0x0080)

/*******************  Bit definition for CAN_BASIC_BTR1 register  *******************/
#define  CAN_BASIC_BTR1_SAM                        ((uint16_t)0x0080)

#define  CAN_BASIC_BTR1_TSEG1                      ((uint16_t)0x000F)
#define  CAN_BASIC_BTR1_TSEG1_0                    ((uint16_t)0x0001)
#define  CAN_BASIC_BTR1_TSEG1_1                    ((uint16_t)0x0002)
#define  CAN_BASIC_BTR1_TSEG1_2                    ((uint16_t)0x0004)
#define  CAN_BASIC_BTR1_TSEG1_3                    ((uint16_t)0x0008)

#define  CAN_BASIC_BTR1_TSEG2                      ((uint16_t)0x0070)
#define  CAN_BASIC_BTR1_TSEG2_0                    ((uint16_t)0x0010)
#define  CAN_BASIC_BTR1_TSEG2_1                    ((uint16_t)0x0020)
#define  CAN_BASIC_BTR1_TSEG2_2                    ((uint16_t)0x0040)

/*******************  Bit definition for CAN_BASIC_TXID0 register  *******************/
#define  CAN_BASICTXID0_ID                        ((uint16_t)0x00FF)
#define  CAN_BASIC_TXID0_ID_3                      ((uint16_t)0x0001)
#define  CAN_BASIC_TXID0_ID_4                      ((uint16_t)0x0002)
#define  CAN_BASIC_TXID0_ID_5                      ((uint16_t)0x0004)
#define  CAN_BASIC_TXID0_ID_6                      ((uint16_t)0x0008)
#define  CAN_BASIC_TXID0_ID_7                      ((uint16_t)0x0010)
#define  CAN_BASIC_TXID0_ID_8                      ((uint16_t)0x0020)
#define  CAN_BASIC_TXID0_ID_9                      ((uint16_t)0x0040)
#define  CAN_BASIC_TXID0_ID_10                     ((uint16_t)0x0080)

/*******************  Bit definition for CAN_BASIC_TXID1 register  *******************/
#define  CAN_BASIC_TXID1_RTR                       ((uint16_t)0x0010)
#define  CAN_BASIC_TXID1_DLC                       ((uint16_t)0x000F)
#define  CAN_BASIC_TXID1_DLC_0                     ((uint16_t)0x0001)
#define  CAN_BASIC_TXID1_DLC_1                     ((uint16_t)0x0002)
#define  CAN_BASIC_TXID1_DLC_2                     ((uint16_t)0x0004)
#define  CAN_BASIC_TXID1_DLC_3                     ((uint16_t)0x0008)

