RT-Thread/rt-thread/bsp/mm32l07x/Libraries/MM32L0xx/Include/MM32L0xx.h
/*******************  Bit definition for CAN_PELI_ACR2 register  *******************/
#define  CAN_PELI_ACR2_AC                          ((uint16_t)0x00FF)
#define  CAN_PELI_ACR2_AC_0                        ((uint16_t)0x0001)
#define  CAN_PELI_ACR2_AC_1                        ((uint16_t)0x0002)
#define  CAN_PELI_ACR2_AC_2                        ((uint16_t)0x0004)
#define  CAN_PELI_ACR2_AC_3                        ((uint16_t)0x0008)
#define  CAN_PELI_ACR2_AC_4                        ((uint16_t)0x0010)
#define  CAN_PELI_ACR2_AC_5                        ((uint16_t)0x0020)
#define  CAN_PELI_ACR2_AC_6                        ((uint16_t)0x0040)
#define  CAN_PELI_ACR2_AC_7                        ((uint16_t)0x0080)

#define  CAN_PELI_ACR2_AC_SSDATA0_0                ((uint16_t)0x0001)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG DATA0 BIT 0*/
#define  CAN_PELI_ACR2_AC_SSDATA0_1                ((uint16_t)0x0002)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG DATA0 BIT 1*/
#define  CAN_PELI_ACR2_AC_SSDATA0_2                ((uint16_t)0x0004)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG DATA0 BIT 2*/
#define  CAN_PELI_ACR2_AC_SSDATA0_3                ((uint16_t)0x0008)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG DATA0 BIT 3*/
#define  CAN_PELI_ACR2_AC_SSDATA0_4                ((uint16_t)0x0010)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG DATA0 BIT 4*/
#define  CAN_PELI_ACR2_AC_SSDATA0_5                ((uint16_t)0x0020)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG DATA0 BIT 5*/
#define  CAN_PELI_ACR2_AC_SSDATA0_6                ((uint16_t)0x0040)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG DATA0 BIT 6*/
#define  CAN_PELI_ACR2_AC_SSDATA0_7                ((uint16_t)0x0080)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG DATA0 BIT 7*/

#define  CAN_PELI_ACR2_AC_ESID05                   ((uint16_t)0x0001)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID05*/
#define  CAN_PELI_ACR2_AC_ESID06                   ((uint16_t)0x0002)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID06*/
#define  CAN_PELI_ACR2_AC_ESID07                   ((uint16_t)0x0004)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID07*/
#define  CAN_PELI_ACR2_AC_ESID08                   ((uint16_t)0x0008)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID08*/
#define  CAN_PELI_ACR2_AC_ESID09                   ((uint16_t)0x0010)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID09*/
#define  CAN_PELI_ACR2_AC_ESID10                   ((uint16_t)0x0020)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID10*/
#define  CAN_PELI_ACR2_AC_ESID11                   ((uint16_t)0x0040)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID11*/
#define  CAN_PELI_ACR2_AC_ESID12                   ((uint16_t)0x0080)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID12*/

#define  CAN_PELI_ACR2_AC_SDID21                   ((uint16_t)0x0001)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID21*/
#define  CAN_PELI_ACR2_AC_SDID22                   ((uint16_t)0x0002)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID22*/
#define  CAN_PELI_ACR2_AC_SDID23                   ((uint16_t)0x0004)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID23*/
#define  CAN_PELI_ACR2_AC_SDID24                   ((uint16_t)0x0008)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID24*/
#define  CAN_PELI_ACR2_AC_SDID25                   ((uint16_t)0x0010)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID25*/
#define  CAN_PELI_ACR2_AC_SDID26                   ((uint16_t)0x0020)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID26*/
#define  CAN_PELI_ACR2_AC_SDID27                   ((uint16_t)0x0040)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID27*/
#define  CAN_PELI_ACR2_AC_SDID28                   ((uint16_t)0x0080)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID28*/

#define  CAN_PELI_ACR2_AC_EDID21                   ((uint16_t)0x0001)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID21*/
#define  CAN_PELI_ACR2_AC_EDID22                   ((uint16_t)0x0002)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID22*/
#define  CAN_PELI_ACR2_AC_EDID23                   ((uint16_t)0x0004)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID23*/
#define  CAN_PELI_ACR2_AC_EDID24                   ((uint16_t)0x0008)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID24*/
#define  CAN_PELI_ACR2_AC_EDID25                   ((uint16_t)0x0010)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID25*/
#define  CAN_PELI_ACR2_AC_EDID26                   ((uint16_t)0x0020)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID26*/
#define  CAN_PELI_ACR2_AC_EDID27                   ((uint16_t)0x0040)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID27*/
#define  CAN_PELI_ACR2_AC_EDID28                   ((uint16_t)0x0080)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID28*/

/*******************  Bit definition for CAN_PELI_ACR3 register  *******************/
#define  CAN_PELI_ACR3_AC                          ((uint16_t)0x00FF)
#define  CAN_PELI_ACR3_AC_0                        ((uint16_t)0x0001)
#define  CAN_PELI_ACR3_AC_1                        ((uint16_t)0x0002)
#define  CAN_PELI_ACR3_AC_2                        ((uint16_t)0x0004)
#define  CAN_PELI_ACR3_AC_3                        ((uint16_t)0x0008)
#define  CAN_PELI_ACR3_AC_4                        ((uint16_t)0x0010)
#define  CAN_PELI_ACR3_AC_5                        ((uint16_t)0x0020)
#define  CAN_PELI_ACR3_AC_6                        ((uint16_t)0x0040)
#define  CAN_PELI_ACR3_AC_7                        ((uint16_t)0x0080)

#define  CAN_PELI_ACR3_AC_SSDATA1_0                ((uint16_t)0x0001)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG DATA1 BIT 0*/
#define  CAN_PELI_ACR3_AC_SSDATA1_1                ((uint16_t)0x0002)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG DATA1 BIT 1*/
#define  CAN_PELI_ACR3_AC_SSDATA1_2                ((uint16_t)0x0004)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG DATA1 BIT 2*/
#define  CAN_PELI_ACR3_AC_SSDATA1_3                ((uint16_t)0x0008)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG DATA1 BIT 3*/
#define  CAN_PELI_ACR3_AC_SSDATA1_4                ((uint16_t)0x0010)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG DATA1 BIT 4*/
#define  CAN_PELI_ACR3_AC_SSDATA1_5                ((uint16_t)0x0020)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG DATA1 BIT 5*/
#define  CAN_PELI_ACR3_AC_SSDATA1_6                ((uint16_t)0x0040)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG DATA1 BIT 6*/
#define  CAN_PELI_ACR3_AC_SSDATA1_7                ((uint16_t)0x0080)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG DATA1 BIT 7*/

#define  CAN_PELI_ACR3_AC_ESRTR                    ((uint16_t)0x0004)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG RTR*/
#define  CAN_PELI_ACR3_AC_ESID00                   ((uint16_t)0x0008)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID00*/
#define  CAN_PELI_ACR3_AC_ESID01                   ((uint16_t)0x0010)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID01*/
#define  CAN_PELI_ACR3_AC_ESID02                   ((uint16_t)0x0020)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID02*/
#define  CAN_PELI_ACR3_AC_ESID03                   ((uint16_t)0x0040)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID03*/
#define  CAN_PELI_ACR3_AC_ESID04                   ((uint16_t)0x0080)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID04*/

