RT-Thread/rt-thread/bsp/mm32l07x/Libraries/MM32L0xx/Include/MM32L0xx.h
#define  CAN_PELI_AMR1_AM_EDID13                   ((uint16_t)0x0001)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID13*/
#define  CAN_PELI_AMR1_AM_EDID14                   ((uint16_t)0x0002)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID14*/
#define  CAN_PELI_AMR1_AM_EDID15                   ((uint16_t)0x0004)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID15*/
#define  CAN_PELI_AMR1_AM_EDID16                   ((uint16_t)0x0008)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID16*/
#define  CAN_PELI_AMR1_AM_EDID17                   ((uint16_t)0x0010)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID17*/
#define  CAN_PELI_AMR1_AM_EDID18                   ((uint16_t)0x0020)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID18*/
#define  CAN_PELI_AMR1_AM_EDID19                   ((uint16_t)0x0040)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID19*/
#define  CAN_PELI_AMR1_AM_EDID20                   ((uint16_t)0x0080)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID20*/

/*******************  Bit definition for CAN_PELI_AMR2 register  *******************/
#define  CAN_PELI_AMR2_AM                          ((uint16_t)0x00FF)
#define  CAN_PELI_AMR2_AM_0                        ((uint16_t)0x0001)
#define  CAN_PELI_AMR2_AM_1                        ((uint16_t)0x0002)
#define  CAN_PELI_AMR2_AM_2                        ((uint16_t)0x0004)
#define  CAN_PELI_AMR2_AM_3                        ((uint16_t)0x0008)
#define  CAN_PELI_AMR2_AM_4                        ((uint16_t)0x0010)
#define  CAN_PELI_AMR2_AM_5                        ((uint16_t)0x0020)
#define  CAN_PELI_AMR2_AM_6                        ((uint16_t)0x0040)
#define  CAN_PELI_AMR2_AM_7                        ((uint16_t)0x0080)

#define  CAN_PELI_AMR2_AM_SSDATA0_0                ((uint16_t)0x0001)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG DATA0 BIT 0*/
#define  CAN_PELI_AMR2_AM_SSDATA0_1                ((uint16_t)0x0002)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG DATA0 BIT 1*/
#define  CAN_PELI_AMR2_AM_SSDATA0_2                ((uint16_t)0x0004)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG DATA0 BIT 2*/
#define  CAN_PELI_AMR2_AM_SSDATA0_3                ((uint16_t)0x0008)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG DATA0 BIT 3*/
#define  CAN_PELI_AMR2_AM_SSDATA0_4                ((uint16_t)0x0010)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG DATA0 BIT 4*/
#define  CAN_PELI_AMR2_AM_SSDATA0_5                ((uint16_t)0x0020)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG DATA0 BIT 5*/
#define  CAN_PELI_AMR2_AM_SSDATA0_6                ((uint16_t)0x0040)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG DATA0 BIT 6*/
#define  CAN_PELI_AMR2_AM_SSDATA0_7                ((uint16_t)0x0080)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG DATA0 BIT 7*/

#define  CAN_PELI_AMR2_AM_ESID05                   ((uint16_t)0x0001)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID05*/
#define  CAN_PELI_AMR2_AM_ESID06                   ((uint16_t)0x0002)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID06*/
#define  CAN_PELI_AMR2_AM_ESID07                   ((uint16_t)0x0004)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID07*/
#define  CAN_PELI_AMR2_AM_ESID08                   ((uint16_t)0x0008)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID08*/
#define  CAN_PELI_AMR2_AM_ESID09                   ((uint16_t)0x0010)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID09*/
#define  CAN_PELI_AMR2_AM_ESID10                   ((uint16_t)0x0020)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID10*/
#define  CAN_PELI_AMR2_AM_ESID11                   ((uint16_t)0x0040)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID11*/
#define  CAN_PELI_AMR2_AM_ESID12                   ((uint16_t)0x0080)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID12*/

#define  CAN_PELI_AMR2_AM_SDID21                   ((uint16_t)0x0001)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID21*/
#define  CAN_PELI_AMR2_AM_SDID22                   ((uint16_t)0x0002)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID22*/
#define  CAN_PELI_AMR2_AM_SDID23                   ((uint16_t)0x0004)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID23*/
#define  CAN_PELI_AMR2_AM_SDID24                   ((uint16_t)0x0008)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID24*/
#define  CAN_PELI_AMR2_AM_SDID25                   ((uint16_t)0x0010)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID25*/
#define  CAN_PELI_AMR2_AM_SDID26                   ((uint16_t)0x0020)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID26*/
#define  CAN_PELI_AMR2_AM_SDID27                   ((uint16_t)0x0040)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID27*/
#define  CAN_PELI_AMR2_AM_SDID28                   ((uint16_t)0x0080)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID28*/

#define  CAN_PELI_AMR2_AM_EDID21                   ((uint16_t)0x0001)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID21*/
#define  CAN_PELI_AMR2_AM_EDID22                   ((uint16_t)0x0002)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID22*/
#define  CAN_PELI_AMR2_AM_EDID23                   ((uint16_t)0x0004)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID23*/
#define  CAN_PELI_AMR2_AM_EDID24                   ((uint16_t)0x0008)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID24*/
#define  CAN_PELI_AMR2_AM_EDID25                   ((uint16_t)0x0010)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID25*/
#define  CAN_PELI_AMR2_AM_EDID26                   ((uint16_t)0x0020)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID26*/
#define  CAN_PELI_AMR2_AM_EDID27                   ((uint16_t)0x0040)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID27*/
#define  CAN_PELI_AMR2_AM_EDID28                   ((uint16_t)0x0080)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID28*/

/*******************  Bit definition for CAN_PELI_AMR3 register  *******************/
#define  CAN_PELI_AMR3_AM                          ((uint16_t)0x00FF)
#define  CAN_PELI_AMR3_AM_0                        ((uint16_t)0x0001)
#define  CAN_PELI_AMR3_AM_1                        ((uint16_t)0x0002)
#define  CAN_PELI_AMR3_AM_2                        ((uint16_t)0x0004)
#define  CAN_PELI_AMR3_AM_3                        ((uint16_t)0x0008)
#define  CAN_PELI_AMR3_AM_4                        ((uint16_t)0x0010)
#define  CAN_PELI_AMR3_AM_5                        ((uint16_t)0x0020)
#define  CAN_PELI_AMR3_AM_6                        ((uint16_t)0x0040)
#define  CAN_PELI_AMR3_AM_7                        ((uint16_t)0x0080)

#define  CAN_PELI_AMR3_AM_SSDATA1_0                ((uint16_t)0x0001)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG DATA1 BIT 0*/
#define  CAN_PELI_AMR3_AM_SSDATA1_1                ((uint16_t)0x0002)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG DATA1 BIT 1*/
#define  CAN_PELI_AMR3_AM_SSDATA1_2                ((uint16_t)0x0004)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG DATA1 BIT 2*/
#define  CAN_PELI_AMR3_AM_SSDATA1_3                ((uint16_t)0x0008)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG DATA1 BIT 3*/
#define  CAN_PELI_AMR3_AM_SSDATA1_4                ((uint16_t)0x0010)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG DATA1 BIT 4*/
#define  CAN_PELI_AMR3_AM_SSDATA1_5                ((uint16_t)0x0020)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG DATA1 BIT 5*/
#define  CAN_PELI_AMR3_AM_SSDATA1_6                ((uint16_t)0x0040)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG DATA1 BIT 6*/
#define  CAN_PELI_AMR3_AM_SSDATA1_7                ((uint16_t)0x0080)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG DATA1 BIT 7*/

#define  CAN_PELI_AMR3_AM_ESRTR                    ((uint16_t)0x0004)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG RTR*/
#define  CAN_PELI_AMR3_AM_ESID00                   ((uint16_t)0x0008)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID00*/
#define  CAN_PELI_AMR3_AM_ESID01                   ((uint16_t)0x0010)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID01*/
#define  CAN_PELI_AMR3_AM_ESID02                   ((uint16_t)0x0020)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID02*/
#define  CAN_PELI_AMR3_AM_ESID03                   ((uint16_t)0x0040)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID03*/
#define  CAN_PELI_AMR3_AM_ESID04                   ((uint16_t)0x0080)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID04*/

